#include <stdio.h>
////指针
//int main()
//{
//	int a = 10;
//	int* pa = &a; //将a的地址放到指针变量pa中
//	//指针就是地址，口头说的指针其实是指针变量
//	return 0;
//}


////指针类型
//int main()
//{
//	char c = 'a';
//	short s = 10;
//	int i = 100;
//
//	char* pc = &c; //字符型指针变量
//	short* ps = &s; //短整型指针变量
//	int* pi = &i; //整型指针变量
//
//	printf("%zu %zu %zu\n", sizeof(pc), sizeof(ps), sizeof(pi)); //打印结果为：8 8 8
//	//指针变量在64位平台上大小固定为8个字节
//	return 0;
//}


////指针类型的第一个意义
//int main()
//{
//	int a = 0x11223344;
//	int* pa = &a;
//	*pa = 0;
//	printf("%x\n", a); //打印结果为：0
//	
//	a = 0x11223344;
//	char* pc = &a;
//	*pc = 0;
//	printf("%x\n", a); //打印结果为：11223300
//
//	a = 0x11223344;
//	short* ps = &a;
//	*ps = 0;
//	printf("%x\n", a); //打印结果为：11220000
//
//	//从上面可以看出，指针类型决定了解引用指针时可以访问几个字节
//	//用整型指针接收，可以改变4个字节，字符指针改变1个字节，短整型指针改变2个字节
//	return 0;
//}


////指针类型的第二个意义
//int main()
//{
//	int a = 10;
//	int* pa = &a;
//	char* pc = &a;
//	short* ps = &a;
//	printf("%p %p\n", pa, pa + 1); //打印结果为：00000060476FF614 00000060476FF618
//	printf("%p %p\n", pc, pc + 1); //打印结果为：00000060476FF614 00000060476FF615
//	printf("%p %p\n", ps, ps + 1); //打印结果为：00000060476FF614 00000060476FF616
//	
//	//用整型指针接收的话，加1跳过了一个整型，地址会加4
//	//用字符型指针接收的话，加1跳过了一个字符型，地址会加1
//	//用短整型指针接收的话，加1跳过了一个短整型，地址会加2
//	//因此指针类型决定了指针进行加减整数时，一步可以走多远（步长）
//	return 0;
//}


////用指针对数组初始化
//int main()
//{
//	int arr[10] = { 0 }, arr1[10] = { 0 };
//	int* pa = &arr[0]; //拿到数组首元素
//	char* pc = &arr1[0]; //用char*指针接收，即使可以改变步长，但一次也只改变1个字节，而不是4个字节
//
//	for (int i = 0; i < 10; i++)
//		*(pa++) = i + 1; //对数组初始化为：1 2 3 4 5 6 7 8 9 10
//
//	for (int i = 0; i < 10; i++)
//		printf("%d ", arr[i]);
//	printf("\n");
//	return 0;
//}


////指针创建未初始化
//int main()
//{
//	int* p;
//	//*p = 20; //这里报错，因为使用了未初始化的局部变量"p"
//	//printf("%d\n", *p);
//	
//	//创建了指针但未初始化时，里面存储的是随机值，这里的指针就是野指针
//	//如果要修改这个值的话，会造成非法访问
//	return 0;
//}


////指针越界访问
//int main()
//{
//	int arr[10] = { 0 };
//	int* p = &arr[0];
//	printf("%d %d\n", arr[-1], arr[11]); //打印结果为：-858993460 -858993460
//	//arr[-1]、arr[11]是以有符号整型的形式打印这两个内存中的内容
//
//	printf("%d %d\n", *(p - 1), *(p + 11)); //打印结果为：-858993460 -858993460
//	//本质上这就是野指针的越界访问，这里的p就是野指针，数组名本质也是指针
//	return 0;
//}


////指针指向已释放的空间
//int* test()
//{
//	int a = 10;
//	return &a;
//}
//
//int main()
//{
//	int* p = test(); //用"p"接收变量"a"的地址，但出了test()作用域时，变量"a"已经被销毁
//	*p = 100; //这里访问了已经销毁的空间，p就是野指针
//	return 0;
//}


////指针创建时初始化
//int main()
//{
//	int* p = NULL; //如果指针创建时，不知道指向哪里，可以初始化为空指针
//	return 0;
//}


////指针指向空间释放时，将指针置空
//int main()
//{
//	int a = 10;
//	int* p = &a;
//	*p = 100;
//	p = NULL; //指针使用结束之后要及时释放
//	return 0;
//}


////避免返回局部变量的地址
//int* test()
//{
//	int a = 10;
//	return &a; //这里写语法正确，但是尽量避免
//}
//
//int main()
//{ 
//	return 0; 
//}


////指针使用之前可以判断是否为空
//int main()
//{
//	int a = 10;
//	int* p = &a;
//	if (p != NULL) //指针使用之前最好进行判断
//		*p = 100; //使用指针
//	return 0;
//}


//指针加减整数
int main()
{

	return 0;
}